Repository: MauCariApa-com/auto-flush-redis
Catalog: languages/auto-flush-cache-*.po
Languages: id_id, ja, zh_cn

source: Auto Flush Cache Settings
id_id: Pengaturan Auto Flush Cache
ja: 自動キャッシュフラッシュ設定
zh_cn: 自动刷新缓存设置

source: Cache Type
id_id: Tipe Cache
ja: キャッシュタイプ
zh_cn: 缓存类型

source: Redis/Valkey IP
id_id: IP Redis/Valkey

source: Redis/Valkey Port
id_id: Port Redis/Valkey
ja: Redis/Valkey ポート
zh_cn: Redis/Valkey 端口

source: Auto Flush Interval
id_id: Interval Auto Flush
ja: 自動フラッシュ間隔
zh_cn: 自动刷新间隔

source: Days
id_id: Hari
ja: 日
zh_cn: 天

source: How to Find Redis/Valkey IP and Port
id_id: Cara Menemukan IP dan Port Redis/Valkey
ja: Redis/Valkey の IP とポートの見つけ方
zh_cn: 如何找到 Redis/Valkey 的 IP 和端口

source: Follow the steps below to find the IP address and port for your Redis or Valkey server:
id_id: Ikuti langkah-langkah di bawah ini untuk menemukan alamat IP dan port untuk server Redis atau Valkey Anda:
ja: 以下の手順に従って、Redis または Valkey サーバーの IP アドレスとポートを見つけてください：
zh_cn: 按照以下步骤找到您的 Redis 或 Valkey 服务器的 IP 地址和端口：

source: For Redis on a Local Machine:
id_id: Untuk Redis di Mesin Lokal:
ja: ローカルマシン上の Redis：
zh_cn: 本地机器上的 Redis：

source: Open your terminal and run: redis-cli
id_id: Buka terminal Anda dan jalankan: redis-cli
ja: ターミナルを開き、次のコマンドを実行します：redis-cli
zh_cn: 打开终端并运行：redis-cli

source: By default, Redis runs on IP: 127.0.0.1 and Port: 6379. You can confirm this by running: INFO
id_id: Secara default, Redis berjalan di IP: 127.0.0.1 dan Port: 6379. Anda dapat mengonfirmasi ini dengan menjalankan: INFO
ja: デフォルトでは、Redis は IP: 127.0.0.1 とポート: 6379 で実行されます。これを確認するには、次のコマンドを実行します：INFO
zh_cn: 默认情况下，Redis 运行在 IP: 127.0.0.1 和端口: 6379。您可以通过运行：INFO 来确认

source: If you're using a custom configuration file, check your Redis config file (usually /etc/redis/redis.conf) for the bind IP and port settings.
id_id: Jika Anda menggunakan file konfigurasi khusus, periksa file konfigurasi Redis Anda (biasanya /etc/redis/redis.conf) untuk pengaturan IP dan port.
ja: カスタム構成ファイルを使用している場合は、Redis の設定ファイル（通常 /etc/redis/redis.conf）でバインド IP とポート設定を確認してください。
zh_cn: 如果您使用的是自定义配置文件，请检查 Redis 配置文件（通常是 /etc/redis/redis.conf）中的绑定 IP 和端口设置。

source: For Redis on a Remote Server:
id_id: Untuk Redis di Server Jarak Jauh:
ja: リモートサーバー上の Redis：
zh_cn: 远程服务器上的 Redis：

source: SSH into your remote server where Redis is installed.
id_id: SSH ke server jarak jauh Anda di mana Redis diinstal.
ja: Redis がインストールされているリモートサーバーに SSH で接続します。
zh_cn: SSH 进入您安装 Redis 的远程服务器。

source: Run redis-cli to connect to the Redis server.
id_id: Jalankan redis-cli untuk terhubung ke server Redis.
ja: redis-cli を実行して Redis サーバーに接続します。
zh_cn: 运行 redis-cli 连接到 Redis 服务器。

source: Check your Redis configuration file (/etc/redis/redis.conf) for the server's IP address and port number (under bind and port settings).
id_id: Periksa file konfigurasi Redis Anda (/etc/redis/redis.conf) untuk alamat IP dan nomor port server (di bawah pengaturan bind dan port).
ja: Redis の設定ファイル（/etc/redis/redis.conf）でサーバーの IP アドレスとポート番号（バインドおよびポート設定の下）を確認してください。
zh_cn: 检查您的 Redis 配置文件（/etc/redis/redis.conf）中的服务器 IP 地址和端口号（在绑定和端口设置下）。

source: If Redis is behind a firewall or proxy, ensure you are using the correct external IP address and that the necessary ports are open.
id_id: Jika Redis berada di balik firewall atau proxy, pastikan Anda menggunakan alamat IP eksternal yang benar dan port yang diperlukan terbuka.
ja: Redis がファイアウォールやプロキシの背後にある場合は、正しい外部 IP アドレスを使用していることと、必要なポートが開いていることを確認してください。
zh_cn: 如果 Redis 位于防火墙或代理后面，请确保您使用正确的外部 IP 地址，并且必要的端口已打开。

source: For Valkey:
id_id: Untuk Valkey:
ja: Valkey の場合：
zh_cn: 对于 Valkey：

source: Check your Valkey installation documentation for the default IP and port configuration.
id_id: Periksa dokumentasi instalasi Valkey Anda untuk konfigurasi IP dan port default.
ja: Valkey のインストール文書で、デフォルトの IP とポートの設定を確認してください。
zh_cn: 查看您的 Valkey 安装文档以获取默认 IP 和端口配置。

source: Typically, the default IP is 127.0.0.1 and the default port is 6380, but this can vary based on your setup.
id_id: Biasanya, IP default adalah 127.0.0.1 dan port default adalah 6380, tetapi ini dapat bervariasi berdasarkan pengaturan Anda.
ja: 通常、デフォルトの IP は 127.0.0.1 で、デフォルトのポートは 6380 ですが、設定によって異なる場合があります。
zh_cn: 通常，默认 IP 是 127.0.0.1，默认端口是 6380，但这可能会根据您的设置有所不同。

source: If Valkey is hosted remotely, check the server's network configuration and Valkey's config file for the correct IP address and port.
id_id: Jika Valkey dihosting secara jarak jauh, periksa konfigurasi jaringan server dan file konfigurasi Valkey untuk alamat IP dan port yang benar.
ja: Valkey がリモートでホスティングされている場合は、サーバーのネットワーク構成と Valkey の設定ファイルで正しい IP アドレスとポートを確認してください。
zh_cn: 如果 Valkey 是远程托管的，请检查服务器的网络配置和 Valkey 的配置文件，以获取正确的 IP 地址和端口。

source: If you are unsure, consult your cloud provider or hosting service for the correct Redis or Valkey IP and port details.
id_id: Jika Anda tidak yakin, konsultasikan dengan penyedia cloud atau layanan hosting Anda untuk detail IP dan port Redis atau Valkey yang benar.
ja: 不明な場合は、クラウドプロバイダーまたはホスティングサービスにお問い合わせいただき、正しい Redis または Valkey の IP およびポートの詳細を確認してください。
zh_cn: 如果您不确定，请咨询您的云服务提供商或托管服务以获取正确的 Redis 或 Valkey IP 和端口详情。

source: If you find this plugin helpful, please consider supporting us by making a donation:
id_id: Jika Anda merasa plugin ini bermanfaat, pertimbangkan untuk mendukung kami dengan memberikan donasi:
ja: このプラグインが役立つと感じた場合は、寄付をしてサポートしていただけると幸いです：
zh_cn: 如果您觉得这个插件有用，请考虑通过捐款来支持我们：

source: Donate via PayPal
id_id: Donasi melalui PayPal
ja: PayPal で寄付
zh_cn: 通过 PayPal 捐款

source: Auto Flush Cache
ja: 自動キャッシュフラッシュ
zh_cn: 自动刷新缓存
