Repository: MauCariApa-com/auto-flush-redis
Catalog: languages/auto-flush-redis-*.po
Languages: de_de, es_es, fr_fr, ko, pt_pt, ru_ru

source: Auto Flush Cache Settings
de_de: Automatische Cache-Leerungseinstellungen
es_es: Configuración de Vacío Automático de Caché
fr_fr: Paramètres de Vidage Automatique du Cache
ko: 자동 캐시 플러시 설정
pt_pt: Configurações de Limpeza Automática de Cache
ru_ru: Настройки Автоматической Очистки Кэша

source: Auto Flush Cache
de_de: Automatische Cache-Leerung
es_es: Vacío Automático de Caché
fr_fr: Vidage Automatique du Cache
ko: 자동 캐시 플러시
pt_pt: Limpeza Automática de Cache
ru_ru: Автоматическая Очистка Кэша

source: Cache Type
de_de: Cache-Typ
es_es: Tipo de Caché
fr_fr: Type de Cache
ko: 캐시 유형
pt_pt: Tipo de Cache
ru_ru: Тип Кэша

source: Redis/Valkey IP
es_es: IP de Redis/Valkey
fr_fr: IP Redis/Valkey
pt_pt: IP Redis/Valkey
ru_ru: IP Redis/Valkey

source: Redis/Valkey Port
es_es: Puerto de Redis/Valkey
fr_fr: Port Redis/Valkey
ko: Redis/Valkey 포트
pt_pt: Porta Redis/Valkey
ru_ru: Порт Redis/Valkey

source: Auto Flush Interval
de_de: Automatisches Leerungsintervall
es_es: Intervalo de Vacío Automático
fr_fr: Intervalle de Vidage Automatique
ko: 자동 플러시 간격
pt_pt: Intervalo de Limpeza Automática
ru_ru: Интервал Автоматической Очистки

source: Days
de_de: Tage
es_es: Días
fr_fr: Jours
ko: 일
pt_pt: Dias
ru_ru: Дни

source: How to Find Redis/Valkey IP and Port
de_de: So finden Sie die IP und den Port von Redis/Valkey
es_es: Cómo Encontrar IP y Puerto de Redis/Valkey
fr_fr: Comment Trouver l'IP et le Port de Redis/Valkey
ko: Redis/Valkey IP 및 포트 찾는 방법
pt_pt: Como Encontrar o IP e a Porta do Redis/Valkey
ru_ru: Как Найти IP и Порт Redis/Valkey

source: Follow the steps below to find the IP address and port for your Redis or Valkey server:
de_de: Befolgen Sie die folgenden Schritte, um die IP-Adresse und den Port Ihres Redis- oder Valkey-Servers zu finden:
es_es: Siga los pasos a continuación para encontrar la dirección IP y el puerto de su servidor Redis o Valkey:
fr_fr: Suivez les étapes ci-dessous pour trouver l'adresse IP et le port de votre serveur Redis ou Valkey :
ko: 아래 단계를 따라 Redis 또는 Valkey 서버의 IP 주소와 포트를 찾으세요:
pt_pt: Siga os passos abaixo para encontrar o endereço IP e a porta do seu servidor Redis ou Valkey:
ru_ru: Следуйте приведенным ниже шагам, чтобы найти IP-адрес и порт вашего сервера Redis или Valkey:

source: For Redis on a Local Machine:
de_de: Für Redis auf einem lokalen Rechner:
es_es: Para Redis en una Máquina Local:
fr_fr: Pour Redis sur une Machine Locale :
ko: 로컬 머신에서 Redis:
pt_pt: Para Redis em uma Máquina Local:
ru_ru: Для Redis на Локальном Компьютере:

source: Open your terminal and run: redis-cli
de_de: Öffnen Sie Ihr Terminal und führen Sie aus: redis-cli
es_es: Abra su terminal y ejecute: redis-cli
fr_fr: Ouvrez votre terminal et exécutez : redis-cli
ko: 터미널을 열고 다음 명령어를 실행하세요: redis-cli
pt_pt: Abra seu terminal e execute: redis-cli
ru_ru: Откройте терминал и выполните: redis-cli

source: By default, Redis runs on IP: 127.0.0.1 and Port: 6379. You can confirm this by running: INFO
de_de: Standardmäßig läuft Redis auf IP: 127.0.0.1 und Port: 6379. Sie können dies bestätigen, indem Sie ausführen: INFO
es_es: Por defecto, Redis se ejecuta en IP: 127.0.0.1 y Puerto: 6379. Puede confirmar esto ejecutando: INFO
fr_fr: Par défaut, Redis fonctionne sur IP : 127.0.0.1 et Port : 6379. Vous pouvez le confirmer en exécutant : INFO
ko: 기본적으로 Redis는 IP: 127.0.0.1 및 포트: 6379에서 실행됩니다. 이를 확인하려면 다음 명령어를 실행하세요: INFO
pt_pt: Por padrão, Redis roda no IP: 127.0.0.1 e Porta: 6379. Você pode confirmar isso executando: INFO
ru_ru: По умолчанию Redis работает на IP: 127.0.0.1 и Порте: 6379. Вы можете подтвердить это, выполнив: INFO

source: If you're using a custom configuration file, check your Redis config file (usually /etc/redis/redis.conf) for the bind IP and port settings.
de_de: Wenn Sie eine benutzerdefinierte Konfigurationsdatei verwenden, überprüfen Sie Ihre Redis-Konfigurationsdatei (normalerweise /etc/redis/redis.conf) auf die Bind-IP- und Port-Einstellungen.
es_es: Si está utilizando un archivo de configuración personalizado, verifique el archivo de configuración de Redis (generalmente /etc/redis/redis.conf) para la IP de enlace y la configuración del puerto.
fr_fr: Si vous utilisez un fichier de configuration personnalisé, vérifiez votre fichier de configuration Redis (généralement /etc/redis/redis.conf) pour les paramètres d'IP de liaison et de port.
ko: 사용자 정의 구성 파일을 사용하는 경우, Redis 구성 파일 (일반적으로 /etc/redis/redis.conf)에서 바인드 IP 및 포트 설정을 확인하세요.
pt_pt: Se você estiver usando um arquivo de configuração personalizado, verifique o arquivo de configuração do Redis (geralmente /etc/redis/redis.conf) para as configurações de IP e porta.
ru_ru: Если вы используете пользовательский файл конфигурации, проверьте файл конфигурации Redis (обычно /etc/redis/redis.conf) на предмет настроек IP и порта.

source: For Redis on a Remote Server:
de_de: Für Redis auf einem Remote-Server:
es_es: Para Redis en un Servidor Remoto:
fr_fr: Pour Redis sur un Serveur à Distance :
ko: 원격 서버에서 Redis:
pt_pt: Para Redis em um Servidor Remoto:
ru_ru: Для Redis на Удаленном Сервере:

source: SSH into your remote server where Redis is installed.
de_de: SSH in Ihren Remote-Server, auf dem Redis installiert ist.
es_es: Conéctese por SSH a su servidor remoto donde está instalado Redis.
fr_fr: Connectez-vous en SSH à votre serveur distant où Redis est installé.
ko: Redis가 설치된 원격 서버에 SSH로 접속하세요.
pt_pt: Conecte-se via SSH ao seu servidor remoto onde o Redis está instalado.
ru_ru: Подключитесь по SSH к удаленному серверу, на котором установлен Redis.

source: Run redis-cli to connect to the Redis server.
de_de: Führen Sie redis-cli aus, um eine Verbindung zum Redis-Server herzustellen.
es_es: Ejecute redis-cli para conectarse al servidor Redis.
fr_fr: Exécutez redis-cli pour vous connecter au serveur Redis.
ko: redis-cli를 실행하여 Redis 서버에 연결하세요.
pt_pt: Execute redis-cli para se conectar ao servidor Redis.
ru_ru: Запустите redis-cli для подключения к серверу Redis.

source: Check your Redis configuration file (/etc/redis/redis.conf) for the server's IP address and port number (under bind and port settings).
de_de: Überprüfen Sie Ihre Redis-Konfigurationsdatei (/etc/redis/redis.conf) auf die IP-Adresse und die Portnummer des Servers (unter Bind- und Port-Einstellungen).
es_es: Verifique el archivo de configuración de Redis (/etc/redis/redis.conf) para la dirección IP del servidor y el número de puerto (bajo las configuraciones de enlace y puerto).
fr_fr: Vérifiez votre fichier de configuration Redis (/etc/redis/redis.conf) pour l'adresse IP du serveur et le numéro de port (sous les paramètres de liaison et de port).
ko: Redis 구성 파일 (/etc/redis/redis.conf)에서 서버의 IP 주소와 포트 번호 (바인드 및 포트 설정 아래)를 확인하세요.
pt_pt: Verifique o arquivo de configuração do Redis (/etc/redis/redis.conf) para o endereço IP e o número da porta do servidor (nas configurações de bind e porta).
ru_ru: Проверьте файл конфигурации Redis (/etc/redis/redis.conf) на предмет IP-адреса и номера порта сервера (в разделе настроек bind и порта).

source: If Redis is behind a firewall or proxy, ensure you are using the correct external IP address and that the necessary ports are open.
de_de: Wenn Redis hinter einer Firewall oder einem Proxy steht, stellen Sie sicher, dass Sie die richtige externe IP-Adresse verwenden und dass die erforderlichen Ports geöffnet sind.
es_es: Si Redis está detrás de un firewall o proxy, asegúrese de estar utilizando la dirección IP externa correcta y de que los puertos necesarios estén abiertos.
fr_fr: Si Redis est derrière un pare-feu ou un proxy, assurez-vous d'utiliser la bonne adresse IP externe et que les ports nécessaires sont ouverts.
ko: Redis가 방화벽이나 프록시 뒤에 있는 경우, 올바른 외부 IP 주소를 사용하고 필요한 포트가 열려 있는지 확인하세요.
pt_pt: Se o Redis estiver atrás de um firewall ou proxy, certifique-se de estar usando o endereço IP externo correto e de que as portas necessárias estejam abertas.
ru_ru: Если Redis находится за файрволом или прокси, убедитесь, что вы используете правильный внешний IP-адрес и что необходимые порты открыты.

source: For Valkey:
de_de: Für Valkey:
es_es: Para Valkey:
fr_fr: Pour Valkey :
ko: Valkey의 경우:
pt_pt: Para Valkey:
ru_ru: Для Valkey:

source: Check your Valkey installation documentation for the default IP and port configuration.
de_de: Überprüfen Sie die Installationsdokumentation von Valkey für die Standard-IP- und Portkonfiguration.
es_es: Consulte la documentación de instalación de Valkey para la configuración de IP y puerto predeterminados.
fr_fr: Consultez la documentation d'installation de Valkey pour la configuration IP et port par défaut.
ko: Valkey 설치 문서에서 기본 IP 및 포트 구성을 확인하세요.
pt_pt: Consulte a documentação de instalação do Valkey para a configuração padrão de IP e porta.
ru_ru: Проверьте документацию по установке Valkey для получения настроек IP и порта по умолчанию.

source: Typically, the default IP is 127.0.0.1 and the default port is 6380, but this can vary based on your setup.
de_de: Typischerweise ist die Standard-IP 127.0.0.1 und der Standardport 6380, aber dies kann je nach Ihrer Konfiguration variieren.
es_es: Normalmente, la IP predeterminada es 127.0.0.1 y el puerto predeterminado es 6380, pero esto puede variar según su configuración.
fr_fr: Typiquement, l'IP par défaut est 127.0.0.1 et le port par défaut est 6380, mais cela peut varier en fonction de votre configuration.
ko: 일반적으로 기본 IP는 127.0.0.1이고 기본 포트는 6380입니다. 그러나 설정에 따라 달라질 수 있습니다.
pt_pt: Normalmente, o IP padrão é 127.0.0.1 e a porta padrão é 6380, mas isso pode variar dependendo da sua configuração.
ru_ru: Обычно IP по умолчанию 127.0.0.1, а порт по умолчанию 6380, но это может варьироваться в зависимости от вашей конфигурации.

source: If Valkey is hosted remotely, check the server's network configuration and Valkey's config file for the correct IP address and port.
de_de: Wenn Valkey remote gehostet wird, überprüfen Sie die Netzwerkkonfiguration des Servers und die Konfigurationsdatei von Valkey auf die korrekte IP-Adresse und den Port.
es_es: Si Valkey está alojado de forma remota, verifique la configuración de red del servidor y el archivo de configuración de Valkey para obtener la dirección IP y el puerto correctos.
fr_fr: Si Valkey est hébergé à distance, vérifiez la configuration réseau du serveur et le fichier de configuration de Valkey pour l'adresse IP et le port corrects.
ko: Valkey가 원격으로 호스팅되는 경우, 서버의 네트워크 구성 및 Valkey의 구성 파일에서 올바른 IP 주소와 포트를 확인하세요.
pt_pt: Se o Valkey estiver hospedado remotamente, verifique a configuração de rede do servidor e o arquivo de configuração do Valkey para o IP e porta corretos.
ru_ru: Если Valkey размещен удаленно, проверьте сетевую конфигурацию сервера и файл конфигурации Valkey для получения правильного IP-адреса и порта.

source: If you are unsure, consult your cloud provider or hosting service for the correct Redis or Valkey IP and port details.
de_de: Wenn Sie sich unsicher sind, wenden Sie sich an Ihren Cloud-Anbieter oder Hosting-Dienst, um die korrekten IP- und Portdetails für Redis oder Valkey zu erhalten.
es_es: Si no está seguro, consulte con su proveedor de servicios en la nube o servicio de alojamiento para obtener los detalles correctos de IP y puerto de Redis o Valkey.
fr_fr: Si vous avez des doutes, consultez votre fournisseur de services cloud ou votre service d'hébergement pour obtenir les détails corrects de l'IP et du port de Redis ou Valkey.
ko: 확실하지 않은 경우, 클라우드 제공업체 또는 호스팅 서비스에 문의하여 올바른 Redis 또는 Valkey IP 및 포트 세부정보를 확인하세요.
pt_pt: Se você não tiver certeza, consulte seu provedor de nuvem ou serviço de hospedagem para obter os detalhes corretos de IP e porta do Redis ou Valkey.
ru_ru: Если вы не уверены, обратитесь к вашему облачному провайдеру или хостинг-службе для получения правильных деталей IP и порта Redis или Valkey.

source: If you find this plugin helpful, please consider supporting us by making a donation:
de_de: Wenn Sie dieses Plugin hilfreich finden, ziehen Sie bitte in Betracht, uns durch eine Spende zu unterstützen:
es_es: Si encuentra útil este plugin, considere apoyarnos haciendo una donación:
fr_fr: Si vous trouvez ce plugin utile, veuillez envisager de nous soutenir en faisant un don :
ko: 이 플러그인이 도움이 되었다면, 기부를 통해 저희를 지원해 주시기 바랍니다:
pt_pt: Se você achar este plugin útil, considere nos apoiar fazendo uma doação:
ru_ru: Если вы нашли этот плагин полезным, пожалуйста, подумайте о поддержке нас, сделав пожертвование:

source: Donate via PayPal
de_de: Über PayPal spenden
es_es: Donar a través de PayPal
fr_fr: Faire un don via PayPal
ko: PayPal로 기부
pt_pt: Doe via PayPal
ru_ru: Пожертвовать через PayPal
